{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/yoshikinakajima/Documents/GitHub/microeconometrics/ex1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Jul 2018, 03:34:06
{txt}
{com}. 
. 
. *******************************
. *******  Assignment 1  ********
. *******************************
. 
. 
. /* Packeges to install for matching method 
> 
> net search propensity score
> // install `st0026_1 from http://www.stata-journal.com/software/sj4-2` 
> 
> ssc install psmatch2
> 
> */
. 
. 
. ********************* Prob 1 ************************
. 
. *** 1-a ***
. 
. use "~/Documents/GitHub/microeconometrics/dataBlun_noc.dta", clear
{txt}
{com}. 
. global N=_N        /* Number of observations */ 
{txt}
{com}. global h = 0.05      /* bandwidth */
{txt}
{com}. global d = "d_eS"    /* 1 if subsidy */ 
{txt}
{com}. 
. 
. global matchX = "x theta"  /* matching variable in true DGP */ 
{txt}
{com}.  
. gen y = $d*ln(y1)+(1-$d)*ln(y0)            /* observed outcome  */
{txt}
{com}. 
. 
. 
. pscore $d $matchX, pscore(ps) /*detail*/



{res}**************************************************** 
Algorithm to estimate the propensity score 
**************************************************** 


The treatment is d_eS

        {txt}education {c |}
     attainment - {c |}
 expected subsidy {c |}      Freq.     Percent        Cum.
{hline 18}{c +}{hline 35}
no high education {c |}{res}      1,303       65.15       65.15
{txt}   high education {c |}{res}        697       34.85      100.00
{txt}{hline 18}{c +}{hline 35}
            Total {c |}{res}      2,000      100.00



Estimation of the propensity score 

{txt}Iteration 0:   log likelihood = {res}-1293.0263
{txt}Iteration 1:   log likelihood = {res}-949.40505
{txt}Iteration 2:   log likelihood = {res}-929.84212
{txt}Iteration 3:   log likelihood = {res}-929.57258
{txt}Iteration 4:   log likelihood = {res}-929.57251

{txt}Probit regression                                 Number of obs   = {res}      2000
                                                  {txt}LR chi2({res}2{txt})      = {res}    726.91
                                                  {txt}Prob > chi2     = {res}    0.0000
{txt}Log likelihood = {res}-929.57251                       {txt}Pseudo R2       = {res}    0.2811

{txt}{hline 13}{c TT}{hline 64}
        d_eS {c |}      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
           x {c |}  {res} .2505665   .0680787     3.68   0.000     .1171347    .3839982
       {txt}theta {c |}  {res} 4.323823   .1870913    23.11   0.000     3.957131    4.690516
       {txt}_cons {c |}  {res}-2.769731   .1129163   -24.53   0.000    -2.991043   -2.548419
{txt}{hline 13}{c BT}{hline 64}



{res}Description of the estimated propensity score 

                 {txt}Estimated propensity score
{hline 61}
      Percentiles      Smallest
 1%    {res} .0056593       .0028806
{txt} 5%    {res} .0170007       .0030394
{txt}10%    {res} .0346989       .0030471       {txt}Obs         {res}      2,000
{txt}25%    {res}  .109664       .0031188       {txt}Sum of Wgt. {res}      2,000

{txt}50%    {res} .2836471                      {txt}Mean          {res} .3495899
                        {txt}Largest       Std. Dev.     {res} .2713848
{txt}75%    {res}  .566432        .955243
{txt}90%    {res} .7661133       .9558381       {txt}Variance      {res} .0736497
{txt}95%    {res} .8541194       .9586234       {txt}Skewness      {res} .5314459
{txt}99%    {res} .9220377       .9636999       {txt}Kurtosis      {res} 2.060968



****************************************************** 
Step 1: Identification of the optimal number of blocks 
Use option detail if you want more detailed output 
****************************************************** 


{txt}The final number of blocks is 8

This number of blocks ensures that the mean propensity score
is not different for treated and controls in each blocks



{res}********************************************************** 
Step 2: Test of balancing property of the propensity score 
Use option detail if you want more detailed output 
********************************************************** 

Variable x is not balanced in block 8

{err}The balancing property is not satisfied 

Try a different specification of the propensity score 

  {txt}Inferior {c |} education attainment
  of block {c |}  - expected subsidy
of pscore  {c |} no high e  high educ {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       435         31 {txt}{c |}{res}       466 
{txt}        .1 {c |}{res}       277         33 {txt}{c |}{res}       310 
{txt}        .2 {c |}{res}       211         56 {txt}{c |}{res}       267 
{txt}        .3 {c |}{res}       114         66 {txt}{c |}{res}       180 
{txt}        .4 {c |}{res}       165        167 {txt}{c |}{res}       332 
{txt}        .6 {c |}{res}        53         94 {txt}{c |}{res}       147 
{txt}        .7 {c |}{res}        28        106 {txt}{c |}{res}       134 
{txt}        .8 {c |}{res}        20        144 {txt}{c |}{res}       164 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}     1,303        697 {txt}{c |}{res}     2,000 



******************************************* 
End of the algorithm to estimate the pscore 
******************************************* 
{txt}
{com}. 
. *** 1-b ***
. gen thetaSq = theta^2
{txt}
{com}. gen thetaX = theta*x 
{txt}
{com}. 
. global matchX2 = "x theta thetaSq thetaX" 
{txt}
{com}. 
. pscore $d $matchX2, pscore(ps2) blockid(blc2) /*detail*/ 



{res}**************************************************** 
Algorithm to estimate the propensity score 
**************************************************** 


The treatment is d_eS

        {txt}education {c |}
     attainment - {c |}
 expected subsidy {c |}      Freq.     Percent        Cum.
{hline 18}{c +}{hline 35}
no high education {c |}{res}      1,303       65.15       65.15
{txt}   high education {c |}{res}        697       34.85      100.00
{txt}{hline 18}{c +}{hline 35}
            Total {c |}{res}      2,000      100.00



Estimation of the propensity score 

{txt}Iteration 0:   log likelihood = {res}-1293.0263
{txt}Iteration 1:   log likelihood = {res}-942.77087
{txt}Iteration 2:   log likelihood = {res}-925.97097
{txt}Iteration 3:   log likelihood = {res}-925.65042
{txt}Iteration 4:   log likelihood = {res}-925.64994

{txt}Probit regression                                 Number of obs   = {res}      2000
                                                  {txt}LR chi2({res}4{txt})      = {res}    734.75
                                                  {txt}Prob > chi2     = {res}    0.0000
{txt}Log likelihood = {res}-925.64994                       {txt}Pseudo R2       = {res}    0.2841

{txt}{hline 13}{c TT}{hline 64}
        d_eS {c |}      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
           x {c |}  {res}-.2348704   .2179395    -1.08   0.281    -.6620239    .1922831
       {txt}theta {c |}  {res} 2.544221   .8871383     2.87   0.004     .8054624    4.282981
     {txt}thetaSq {c |}  {res} 1.344717   .8037943     1.67   0.094    -.2306911    2.920125
      {txt}thetaX {c |}  {res} .9116079   .3883733     2.35   0.019     .1504103    1.672806
       {txt}_cons {c |}  {res}-2.240901   .2408422    -9.30   0.000    -2.712943   -1.768859
{txt}{hline 13}{c BT}{hline 64}



{res}Description of the estimated propensity score 

                 {txt}Estimated propensity score
{hline 61}
      Percentiles      Smallest
 1%    {res} .0130349       .0074363
{txt} 5%    {res} .0265484       .0076314
{txt}10%    {res} .0469422       .0078329       {txt}Obs         {res}      2,000
{txt}25%    {res} .1138968       .0078372       {txt}Sum of Wgt. {res}      2,000

{txt}50%    {res} .2657103                      {txt}Mean          {res} .3483056
                        {txt}Largest       Std. Dev.     {res} .2745203
{txt}75%    {res} .5591377       .9851458
{txt}90%    {res} .7860141       .9854774       {txt}Variance      {res} .0753614
{txt}95%    {res} .8802079       .9869936       {txt}Skewness      {res} .6571694
{txt}99%    {res} .9580365       .9895982       {txt}Kurtosis      {res} 2.236363



****************************************************** 
Step 1: Identification of the optimal number of blocks 
Use option detail if you want more detailed output 
****************************************************** 


{txt}The final number of blocks is 8

This number of blocks ensures that the mean propensity score
is not different for treated and controls in each blocks



{res}********************************************************** 
Step 2: Test of balancing property of the propensity score 
Use option detail if you want more detailed output 
********************************************************** 


{txt}The balancing property is satisfied 


This table shows the inferior bound, the number of treated
and the number of controls for each block 

  Inferior {c |} education attainment
  of block {c |}  - expected subsidy
of pscore  {c |} no high e  high educ {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       421         28 {txt}{c |}{res}       449 
{txt}        .1 {c |}{res}       316         40 {txt}{c |}{res}       356 
{txt}        .2 {c |}{res}       207         64 {txt}{c |}{res}       271 
{txt}        .3 {c |}{res}       112         68 {txt}{c |}{res}       180 
{txt}        .4 {c |}{res}        85         76 {txt}{c |}{res}       161 
{txt}        .5 {c |}{res}        62         84 {txt}{c |}{res}       146 
{txt}        .6 {c |}{res}        81        178 {txt}{c |}{res}       259 
{txt}        .8 {c |}{res}        19        159 {txt}{c |}{res}       178 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}     1,303        697 {txt}{c |}{res}     2,000 



******************************************* 
End of the algorithm to estimate the pscore 
******************************************* 
{txt}
{com}. 
. 
. 
. 
. ********************** Prob 2 ****************************
. 
. *** 2-a ***
. psmatch2 $d $matchX2, kernel outcome(y) kerneltype(epan) bwidth($h) ate
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     2,000
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    734.75
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-925.64994{txt}{col 49}Pseudo R2{col 67}= {res}    0.2841

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        d_eS{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}x {c |}{col 14}{res}{space 2}-.2348704{col 26}{space 2} .2179398{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-.6620245{col 67}{space 3} .1922837
{txt}{space 7}theta {c |}{col 14}{res}{space 2} 2.544221{col 26}{space 2} .8871404{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} .8054582{col 67}{space 3} 4.282985
{txt}{space 5}thetaSq {c |}{col 14}{res}{space 2} 1.344717{col 26}{space 2} .8037958{col 37}{space 1}    1.67{col 46}{space 3}0.094{col 54}{space 4} -.230694{col 67}{space 3} 2.920128
{txt}{space 6}thetaX {c |}{col 14}{res}{space 2} .9116079{col 26}{space 2} .3883737{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .1504095{col 67}{space 3} 1.672806
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.240901{col 26}{space 2} .2408429{col 37}{space 1}   -9.30{col 46}{space 3}0.000{col 54}{space 4}-2.712944{col 67}{space 3}-1.768858
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{hline 28}{c TT}{hline 59}
        Variable     Sample {c |}    Treated     Controls   Difference         S.E.   T-stat
{hline 28}{c +}{hline 59}
               y  Unmatched {c |}{res} 1.33185043   .722169106   .609681326   .048462249    12.58
{txt}{col 17}        ATT {c |}{res} 1.33185043   .743620142    .58823029   .077401855     7.60
{txt}{col 17}        ATU {c |}{res} .722169106   1.11802454   .395855438            .        .
{txt}{col 17}        ATE {c |}{col 56}{res} .462898074            .        .
{txt}{hline 28}{c +}{hline 59}
Note: S.E. does not take into account that the propensity score is estimated.

           {c |} psmatch2:
 psmatch2: {c |}   Common
 Treatment {c |}  support
assignment {c |} On suppor {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
 Untreated {c |}{res}     1,303 {txt}{c |}{res}     1,303 
{txt}   Treated {c |}{res}       697 {txt}{c |}{res}       697 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res}     2,000 {txt}{c |}{res}     2,000 

{txt}
{com}. /* psgraph */
. pstest $matchX2, both

{txt}{hline 26}{c TT}{hline 34}{c TT}{hline 15}{c TT}{hline 10}
                Unmatched {c |}       Mean               %reduct {c |}     t-test    {c |}  V(T)/
Variable          Matched {c |} Treated Control    %bias  |bias| {c |}    t    p>|t| {c |}  V(C)
{hline 26}{c +}{hline 34}{c +}{hline 15}{c +}{hline 10}
x                     {col 24}U  {c |}{res} .44189   .37145     14.4        {txt} {c |}{res}   3.08  0.002 {c |}     .
{txt}{col 24}M  {c |}{res} .44189   .39925      8.7    39.5{txt} {c |}{res}   1.61  0.107 {c |}     .
{txt}{col 24}   {c |}                                  {c |}               {c |}
theta                 {col 24}U  {c |}{res} .65759   .40361    141.5        {txt} {c |}{res}  29.83  0.000 {c |}  0.87
{txt}{col 24}M  {c |}{res} .65759   .65988     -1.3    99.1{txt} {c |}{res}  -0.24  0.810 {c |}  0.91
{txt}{col 24}   {c |}                                  {c |}               {c |}
thetaSq               {col 24}U  {c |}{res} .46234   .19736    138.8        {txt} {c |}{res}  30.90  0.000 {c |}  1.77*
{txt}{col 24}M  {c |}{res} .46234   .46849     -3.2    97.7{txt} {c |}{res}  -0.51  0.607 {c |}  0.88
{txt}{col 24}   {c |}                                  {c |}               {c |}
thetaX                {col 24}U  {c |}{res} .29115   .14406     50.9        {txt} {c |}{res}  11.66  0.000 {c |}  2.61*
{txt}{col 24}M  {c |}{res} .29115   .25172     13.6    73.2{txt} {c |}{res}   2.18  0.029 {c |}  1.13
{txt}{col 24}   {c |}                                  {c |}               {c |}
{hline 26}{c BT}{hline 34}{c BT}{hline 15}{c BT}{hline 10}
* if variance ratio outside [0.86; 1.16] for U and [0.86; 1.16] for M

{hline 11}{c TT}{hline 71}
 Sample    {c |} Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
{hline 11}{c +}{hline 71}
 Unmatched {c | }{res} 0.284    734.75    0.000     86.4      94.8     142.9*{col 70} 1.24{col 79} 67
{txt} Matched   {c | }{res} 0.006     11.71    0.020      6.7       6.0      18.3{col 70} 0.90{col 79}  0
{txt}{hline 11}{c BT}{hline 71}
* if B>25%, R outside [0.5; 2]

{com}. 
. 
. bootstrap att=r(att) atu=r(atu) ate=r(ate), reps(50) seed(321): /// 
> psmatch2 $d $matchX2, kernel outcome(y) kerneltype(epan) bwidth(.05) ate 
{txt}(running psmatch2 on estimation sample)

Bootstrap replications ({res}50{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
{res}
{txt}Bootstrap results{col 49}Number of obs{col 67}= {res}     2,000
{txt}{col 49}Replications{col 67}= {res}        50
{p2colset 7 17 21 2}{...}

{txt}{p2col :command:}psmatch2 d_eS x theta thetaSq thetaX, kernel outcome(y) kerneltype(epan) bwidth(.05) ate {p_end}
{p2colset 11 17 21 2}{...}
{p2col :att:}{res:r(att)}{p_end}
{p2colset 11 17 21 2}{...}
{p2col :atu:}{res:r(atu)}{p_end}
{p2colset 11 17 21 2}{...}
{p2col :ate:}{res:r(ate)}{p_end}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}att {c |}{col 14}{res}{space 2} .5882303{col 26}{space 2} .0646265{col 37}{space 1}    9.10{col 46}{space 3}0.000{col 54}{space 4} .4615646{col 67}{space 3}  .714896
{txt}{space 9}atu {c |}{col 14}{res}{space 2} .3958554{col 26}{space 2} .0720523{col 37}{space 1}    5.49{col 46}{space 3}0.000{col 54}{space 4} .2546356{col 67}{space 3} .5370753
{txt}{space 9}ate {c |}{col 14}{res}{space 2} .4628981{col 26}{space 2} .0566115{col 37}{space 1}    8.18{col 46}{space 3}0.000{col 54}{space 4} .3519416{col 67}{space 3} .5738545
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. *** 2-b ***
. psmatch2 $d $matchX2, kernel outcome(y) kerneltype(epan) bwidth($h) common ate
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     2,000
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    734.75
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-925.64994{txt}{col 49}Pseudo R2{col 67}= {res}    0.2841

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        d_eS{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}x {c |}{col 14}{res}{space 2}-.2348704{col 26}{space 2} .2179398{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-.6620245{col 67}{space 3} .1922837
{txt}{space 7}theta {c |}{col 14}{res}{space 2} 2.544221{col 26}{space 2} .8871404{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} .8054582{col 67}{space 3} 4.282985
{txt}{space 5}thetaSq {c |}{col 14}{res}{space 2} 1.344717{col 26}{space 2} .8037958{col 37}{space 1}    1.67{col 46}{space 3}0.094{col 54}{space 4} -.230694{col 67}{space 3} 2.920128
{txt}{space 6}thetaX {c |}{col 14}{res}{space 2} .9116079{col 26}{space 2} .3883737{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .1504095{col 67}{space 3} 1.672806
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.240901{col 26}{space 2} .2408429{col 37}{space 1}   -9.30{col 46}{space 3}0.000{col 54}{space 4}-2.712944{col 67}{space 3}-1.768858
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{hline 28}{c TT}{hline 59}
        Variable     Sample {c |}    Treated     Controls   Difference         S.E.   T-stat
{hline 28}{c +}{hline 59}
               y  Unmatched {c |}{res} 1.33185043   .722169106   .609681326   .048462249    12.58
{txt}{col 17}        ATT {c |}{res} 1.33219815   .744456074   .587742076   .077067568     7.63
{txt}{col 17}        ATU {c |}{res} .721492347   1.12873228   .407239937            .        .
{txt}{col 17}        ATE {c |}{col 56}{res} .472706059            .        .
{txt}{hline 28}{c +}{hline 59}
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: {c |}   psmatch2: Common
 Treatment {c |}        support
assignment {c |} Off suppo  On suppor {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
 Untreated {c |}{res}        80      1,223 {txt}{c |}{res}     1,303 
{txt}   Treated {c |}{res}         1        696 {txt}{c |}{res}       697 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}        81      1,919 {txt}{c |}{res}     2,000 

{txt}
{com}. psgraph
{res}{txt}
{com}. graph export comsup.png, width(500) replace
{txt}(file comsup.png written in PNG format)

{com}. 
. pstest $matchX2, both

{txt}{hline 26}{c TT}{hline 34}{c TT}{hline 15}{c TT}{hline 10}
                Unmatched {c |}       Mean               %reduct {c |}     t-test    {c |}  V(T)/
Variable          Matched {c |} Treated Control    %bias  |bias| {c |}    t    p>|t| {c |}  V(C)
{hline 26}{c +}{hline 34}{c +}{hline 15}{c +}{hline 10}
x                     {col 24}U  {c |}{res} .44189   .37145     14.4        {txt} {c |}{res}   3.08  0.002 {c |}     .
{txt}{col 24}M  {c |}{res} .44109   .39805      8.8    38.9{txt} {c |}{res}   1.63  0.104 {c |}     .
{txt}{col 24}   {c |}                                  {c |}               {c |}
theta                 {col 24}U  {c |}{res} .65759   .40361    141.5        {txt} {c |}{res}  29.83  0.000 {c |}  0.87
{txt}{col 24}M  {c |}{res} .65711      .66     -1.6    98.9{txt} {c |}{res}  -0.31  0.759 {c |}  0.92
{txt}{col 24}   {c |}                                  {c |}               {c |}
thetaSq               {col 24}U  {c |}{res} .46234   .19736    138.8        {txt} {c |}{res}  30.90  0.000 {c |}  1.77*
{txt}{col 24}M  {c |}{res} .46158     .468     -3.4    97.6{txt} {c |}{res}  -0.54  0.590 {c |}  0.88
{txt}{col 24}   {c |}                                  {c |}               {c |}
thetaX                {col 24}U  {c |}{res} .29115   .14406     50.9        {txt} {c |}{res}  11.66  0.000 {c |}  2.61*
{txt}{col 24}M  {c |}{res} .29014   .25087     13.6    73.3{txt} {c |}{res}   2.18  0.030 {c |}  1.13
{txt}{col 24}   {c |}                                  {c |}               {c |}
{hline 26}{c BT}{hline 34}{c BT}{hline 15}{c BT}{hline 10}
* if variance ratio outside [0.86; 1.16] for U and [0.86; 1.16] for M

{hline 11}{c TT}{hline 71}
 Sample    {c |} Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
{hline 11}{c +}{hline 71}
 Unmatched {c | }{res} 0.284    734.75    0.000     86.4      94.8     142.9*{col 70} 1.24{col 79} 67
{txt} Matched   {c | }{res} 0.006     11.16    0.025      6.8       6.1      17.9{col 70} 0.93{col 79}  0
{txt}{hline 11}{c BT}{hline 71}
* if B>25%, R outside [0.5; 2]

{com}. 
. bootstrap att=r(att) atu=r(atu) ate=r(ate), reps(50) seed(321): /// 
> psmatch2 $d $matchX2, kernel outcome(y) kerneltype(epan) bwidth(.05) common ate
{txt}(running psmatch2 on estimation sample)

Bootstrap replications ({res}50{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
{res}
{txt}Bootstrap results{col 49}Number of obs{col 67}= {res}     2,000
{txt}{col 49}Replications{col 67}= {res}        50
{p2colset 7 17 21 2}{...}

{txt}{p2col :command:}psmatch2 d_eS x theta thetaSq thetaX, kernel outcome(y) kerneltype(epan) bwidth(.05) common ate {p_end}
{p2colset 11 17 21 2}{...}
{p2col :att:}{res:r(att)}{p_end}
{p2colset 11 17 21 2}{...}
{p2col :atu:}{res:r(atu)}{p_end}
{p2colset 11 17 21 2}{...}
{p2col :ate:}{res:r(ate)}{p_end}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}att {c |}{col 14}{res}{space 2} .5877421{col 26}{space 2} .0694304{col 37}{space 1}    8.47{col 46}{space 3}0.000{col 54}{space 4} .4516611{col 67}{space 3} .7238231
{txt}{space 9}atu {c |}{col 14}{res}{space 2} .4072399{col 26}{space 2} .0720558{col 37}{space 1}    5.65{col 46}{space 3}0.000{col 54}{space 4} .2660131{col 67}{space 3} .5484668
{txt}{space 9}ate {c |}{col 14}{res}{space 2} .4727061{col 26}{space 2} .0589985{col 37}{space 1}    8.01{col 46}{space 3}0.000{col 54}{space 4}  .357071{col 67}{space 3} .5883411
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. *** 2-c ***
. psmatch2 $d $matchX2, outcome(y) ai(1) ate
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     2,000
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    734.75
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-925.64994{txt}{col 49}Pseudo R2{col 67}= {res}    0.2841

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        d_eS{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}x {c |}{col 14}{res}{space 2}-.2348704{col 26}{space 2} .2179398{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-.6620245{col 67}{space 3} .1922837
{txt}{space 7}theta {c |}{col 14}{res}{space 2} 2.544221{col 26}{space 2} .8871404{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} .8054582{col 67}{space 3} 4.282985
{txt}{space 5}thetaSq {c |}{col 14}{res}{space 2} 1.344717{col 26}{space 2} .8037958{col 37}{space 1}    1.67{col 46}{space 3}0.094{col 54}{space 4} -.230694{col 67}{space 3} 2.920128
{txt}{space 6}thetaX {c |}{col 14}{res}{space 2} .9116079{col 26}{space 2} .3883737{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .1504095{col 67}{space 3} 1.672806
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.240901{col 26}{space 2} .2408429{col 37}{space 1}   -9.30{col 46}{space 3}0.000{col 54}{space 4}-2.712944{col 67}{space 3}-1.768858
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{hline 28}{c TT}{hline 59}
        Variable     Sample {c |}    Treated     Controls   Difference         S.E.   T-stat
{hline 28}{c +}{hline 59}
               y  Unmatched {c |}{res} 1.33185043   .722169106   .609681326   .048462249    12.58
{txt}{col 17}        ATT {c |}{res} 1.33185043   .842527809   .489322623    .07005424     6.98
{txt}{col 17}        ATU {c |}{res} .722169106   1.09891681   .376747701    .13005381     2.90
{txt}{col 17}        ATE {c |}{col 56}{res} .415980061   .094067639     4.42
{txt}{hline 28}{c +}{hline 59}
Note: Sample S.E.

           {c |} psmatch2:
 psmatch2: {c |}   Common
 Treatment {c |}  support
assignment {c |} On suppor {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
 Untreated {c |}{res}     1,303 {txt}{c |}{res}     1,303 
{txt}   Treated {c |}{res}       697 {txt}{c |}{res}       697 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res}     2,000 {txt}{c |}{res}     2,000 

{txt}
{com}. 
. /* 
> gen att2c = r(att)
> gen atnt2c = r(atu)
> gen ate2c = r(ate)
> display2c att atnt ate
> */ 
. 
. *** 2-d ***
. atts y $d, pscore(ps2) blockid(blc2) comsup



{col 1}{txt}ATT estimation with the Stratification method
{col 1}Analytical standard errors

{hline 57}
{col 1}n. treat.{col 13}n. contr.{col 25}      ATT{col 37}Std. Err.{col 49}        t
{hline 57}

{col 1}{res}      697{col 13}     1223{col 25}    0.546{col 37}    0.068{col 49}    8.074

{txt}{hline 57}

{com}. gen att2d = r(atts)
{txt}
{com}. 
. gen yNeg = -y
{txt}
{com}. gen dNeg = 1-$d
{txt}
{com}. 
. atts yNeg dNeg, pscore(ps2) blockid(blc2)



{col 1}{txt}ATT estimation with the Stratification method
{col 1}Analytical standard errors

{hline 57}
{col 1}n. treat.{col 13}n. contr.{col 25}      ATT{col 37}Std. Err.{col 49}        t
{hline 57}

{col 1}{res}     1303{col 13}      697{col 25}    0.391{col 37}    0.090{col 49}    4.353

{txt}{hline 57}

{com}. gen atnt2d = r(atts)
{txt}
{com}. 
. egen pr = mean($d)
{txt}
{com}. 
. gen ate2d = pr*att2d + (1-pr)*atnt2d
{txt}
{com}. 
. display ate2d
{res}.44524375
{txt}
{com}. 
. 
. ************************* Prob 3 ************************
. 
. *** 3-a ***
. reg y $d $matchX

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,000
{txt}{hline 13}{c +}{hline 34}   F(3, 1996)      = {res}    68.74
{txt}       Model {c |} {res} 215.342017         3  71.7806722   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2084.28536     1,996  1.04423114   {txt}R-squared       ={res}    0.0936
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0923
{txt}       Total {c |} {res} 2299.62737     1,999  1.15038888   {txt}Root MSE        =   {res} 1.0219

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}d_eS {c |}{col 14}{res}{space 2} .5137591{col 26}{space 2} .0578388{col 37}{space 1}    8.88{col 46}{space 3}0.000{col 54}{space 4} .4003284{col 67}{space 3} .6271899
{txt}{space 11}x {c |}{col 14}{res}{space 2} .2973332{col 26}{space 2} .0468713{col 37}{space 1}    6.34{col 46}{space 3}0.000{col 54}{space 4} .2054113{col 67}{space 3} .3892551
{txt}{space 7}theta {c |}{col 14}{res}{space 2} .2952091{col 26}{space 2} .1261282{col 37}{space 1}    2.34{col 46}{space 3}0.019{col 54}{space 4} .0478524{col 67}{space 3} .5425658
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4925737{col 26}{space 2} .0613896{col 37}{space 1}    8.02{col 46}{space 3}0.000{col 54}{space 4} .3721793{col 67}{space 3} .6129682
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. *** 3-b *** 
. 
. // Estimation for ATT using OLS aproach
. reg y $matchX if $d==0 // fit OLS for control group

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,303
{txt}{hline 13}{c +}{hline 34}   F(2, 1300)      = {res}    10.72
{txt}       Model {c |} {res} 21.5347536         2  10.7673768   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1305.41154     1,300  1.00416272   {txt}R-squared       ={res}    0.0162
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0147
{txt}       Total {c |} {res} 1326.94629     1,302  1.01915998   {txt}Root MSE        =   {res} 1.0021

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}x {c |}{col 14}{res}{space 2}   .26657{col 26}{space 2} .0575759{col 37}{space 1}    4.63{col 46}{space 3}0.000{col 54}{space 4} .1536182{col 67}{space 3} .3795218
{txt}{space 7}theta {c |}{col 14}{res}{space 2} .0307384{col 26}{space 2}  .149866{col 37}{space 1}    0.21{col 46}{space 3}0.838{col 54}{space 4}-.2632674{col 67}{space 3} .3247441
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6107451{col 26}{space 2} .0711061{col 37}{space 1}    8.59{col 46}{space 3}0.000{col 54}{space 4} .4712499{col 67}{space 3} .7502403
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict yCF1 if $d==1 // use the estimated coef to build counterfactual for T
{txt}(option {bf:xb} assumed; fitted values)
(1,303 missing values generated)

{com}. gen att_i = y-yCF1 // individuals treatment effect on treated
{txt}(1,303 missing values generated)

{com}. egen attagg = sum(att_i) // (average) treatment effect on treated individual, aggregated
{txt}
{com}. egen nrT = sum($d)   // # obs in treatment group
{txt}
{com}. gen att= attagg/nrT  // average treatment effect
{txt}
{com}. display att
{res}.58309633
{txt}
{com}. 
. // Then estimate ATNT
. reg y $matchX if $d==1 // fit OLS for T

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       697
{txt}{hline 13}{c +}{hline 34}   F(2, 694)       = {res}    15.85
{txt}       Model {c |} {res} 35.1119334         2  17.5559667   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 768.776711       694  1.10774742   {txt}R-squared       ={res}    0.0437
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0409
{txt}       Total {c |} {res} 803.888644       696  1.15501242   {txt}Root MSE        =   {res} 1.0525

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}x {c |}{col 14}{res}{space 2} .3387322{col 26}{space 2} .0802779{col 37}{space 1}    4.22{col 46}{space 3}0.000{col 54}{space 4} .1811155{col 67}{space 3} .4963489
{txt}{space 7}theta {c |}{col 14}{res}{space 2} .8527052{col 26}{space 2} .2305056{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .4001333{col 67}{space 3} 1.305277
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6214326{col 26}{space 2} .1604769{col 37}{space 1}    3.87{col 46}{space 3}0.000{col 54}{space 4} .3063541{col 67}{space 3} .9365111
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict yCF0 if $d==0 // Counterfactual. If C were treated (or has same trend)
{txt}(option {bf:xb} assumed; fitted values)
(697 missing values generated)

{com}. gen atu_i = yCF0 - y // (average) treatment effect on untreated individual
{txt}(697 missing values generated)

{com}. egen atuagg = sum(atu_i) // atu_i, aggregated 
{txt}
{com}. gen nrC = $N - nrT  // # obs in C
{txt}
{com}. gen atnt = atuagg/nrC // average treatment effect on non treated 
{txt}
{com}. display atnt
{res}.3692503
{txt}
{com}. 
. // Notice ATE is weighted ave of ATT and ATNT
. gen ate = (attagg + atuagg)/$N
{txt}
{com}. display ate
{res}.44377565
{txt}
{com}. 
. *** 3-c *** 
. // ATE
. gen ypred3t = y/ps if $d==1  // counterfactual if treated? See Eq20
{txt}(1,303 missing values generated)

{com}. gen ypred3c = y/(1-ps) if $d==0 // CF if untreated?
{txt}(697 missing values generated)

{com}. egen ypred3tsum = sum(ypred3t)
{txt}
{com}. egen ypred3csum= sum(ypred3c)
{txt}
{com}. gen ate3c = (ypred3tsum - ypred3csum)/$N
{txt}
{com}. display ate3c
{res}.58590639
{txt}
{com}. //ATT 
. gen d_ps = $d - ps2
{txt}
{com}. gen d_ps_y = d_ps*y
{txt}
{com}. egen p_d1 = mean($d)
{txt}
{com}. gen d_ps0 = 1-ps
{txt}
{com}. gen p_d_ps0 = p_d1/d_ps0
{txt}
{com}. summarize p_d_ps0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}p_d_ps0 {c |}{res}      2,000    .7966965    .8493553   .3495068   9.600535
{txt}
{com}. gen att3c = r(mean)
{txt}
{com}. display att3c
{res}.79669654
{txt}
{com}. //ATNT
. gen atnt3c = (ate3c*$N - att3c*nrT)/nrC
{txt}
{com}. display atnt3c
{res}.47315064
{txt}
{com}. *********************************************
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/yoshikinakajima/Documents/GitHub/microeconometrics/ex1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Jul 2018, 03:38:41
{txt}{.-}
{smcl}
{txt}{sf}{ul off}